Tekla Open API Reference for Tekla Structures 2025
FacetedBrep Methods
The FacetedBrep type exposes the following members.
Methods
Name | Description
CheckForTwoManifold
 Gets a value indicating whether this instance is 2-manifold.
GetInnerFace
 Gets the inner face at the specified index.
GetInnerFaceCount
 Gets the inner face count of the outer face at the specified index.
GetOuterFace
 Gets the outer face at the specified index.
Top
See Also
Reference
FacetedBrep Class
Tekla.Structures.Geometry3d Namespace